#1)მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც





# 1. მიმატება

print("7 + 5 =", 7 + 5)
print("3 + 9 =", 3 + 9)
print("10 + 15 =", 10 + 15)


# 2. გამოკლება

print("15 - 6 =", 15 - 6)
print("20 - 5 =", 20 - 5)
print("12 - 12 =", 12 - 12)


# 3. გამრავლება

print("6 * 4 =", 6 * 4)
print("5 * 3 =", 5 * 3)
print("2 * 10 =", 2 * 10)


# 4.  გაყოფა

print("12 / 3 =", 12 / 3)
print("20 / 5 =", 20 / 5)
print("15 / 3 =", 15 / 3)


# 5. ხარისხი

print("2 ** 2 =", 2 ** 2)
print("3 ** 3 =", 3 ** 3)
print("5 ** 4 =", 5 ** 4)


# 6. ნაშთიანი გაყოფა

print("10 % 3 =", 10 % 3)
print("15 % 4 =", 15 % 4)
print("9 % 2 =", 9 % 2)


# 7. მთელი გაყოფა

print("7 // 2 =", 7 // 2)
print("9 // 4 =", 9 // 4)
print("10 // 3 =", 10 // 3)




#2)კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინო


# 1)  ხარისი(**)
#გამოიყენება რიცხვის ხარისხში აყვანისთვის.


print(2 ** 3)   
print(5 ** 2)   
print(10 ** 0)  

# 2)  გაყოფა (//)
# ყოფს რიცხვს, აიგნორებს  ნაშთს და გამოაქ მთელი რიცხვი

print(10 // 3) 
print(20 // 4)  
print(7 // 2)   

# 3) % (ნაშთის პოვნა)
# ამ ოპერატორის დახმარებით ვპოულობთ გაყოფის ნაშთს.


print(10 % 3)   
print(20 % 4)   
print(7 % 2)      




#3)დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ



# 1. მთელი გაყოფა

print( 7 // 2)      
print( 10 // 3)    
print( 25 // 4)    
print( 100 // 15) 
print( 9 // 5)      


# 2.  ხარისხი

print( 2 ** 3)     
print( 5 ** 2)      
print( 3 ** 4)      
print( 10 ** 0)    
print( 4 ** 1)      


# 3. ნაშთი

print("10 % 3 =", 10 % 3)      
print("15 % 4 =", 15 % 4)      
print("9 % 2 =", 9 % 2)        
print("100 % 7 =", 100 % 7)    
print("8 % 8 =", 8 % 8)      







#4)ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

#15 / 3 = 5.0
#20 / 4 = 5.0
#100 / 20 = 5.0

#15 // 10 = 1
#10 // 7 = 1
#40 // 12 = 3

#4 * 3 = 12
#40 * 3 = 120
#120 * 3 = 360

#4 ** 3 = 64
#10 ** 3 = 1000
#2 ** 6 = 64
#3 ** 4 = 81

#10 % 7 = 3
#3 % 2 = 1
#50 % 25 = 0
#14 % 11 = 3
#110 % 50 = 10






#5)კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან

#ცვლადი გამოიყენება მხოლოთ 1 ელემენტის შესანახად, სიაში კი შეიძლება 1 ზე მეტი ელემენტის შევინახოთ. 
# სიას ვიყენებთ მაშინ როცა გვინდა ერთ ცვლადში ბევრ ელემენტზე ვიმუშაოთ



#6)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები

list = [ "გიორგი","თბილისი", "გლდანი"]


print(list)

#7)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები


list_2 =[10, 25, 45, 100, 3, 8]


print(list_2)


#8)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები

list_3 = [3.14,  7.77, 9.81, 1.0, ]


print(list_3)


#9)შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები



bool_list = [True, False,  False, True, False]


print(bool_list)


#10)შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი



list_4 = ["hello",  42,  3.1415, True,  [1, 2, 3], False, "world"]


print(list_4)



#11)მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ #ნახოთ შედეგი)

a = int(input("Enter first number: "))
b = int(input("Enter second number: "))


print( a // b )


print(a ** b)


print( a % b )




#12)მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი რიცხვი არის 30 ზე მეტი და #3100ზე ნაკლები დაუპრინტე --> "between 30 and 100", თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 #and 200" , სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"

number = int(input("enter random number: "))


if 30 < number < 100:
    print("between 30 and 100")
elif 100 < number < 200:
    print("between 100 and 200")
else:
    print("other number")





#13)შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)


age = 16                  
name = "saba"                
height = 1.87                
true = True            
hobbies = [ "გიორგი","თბილისი", "გლდანი"] 


print(type(age))       
print(type(name))      
print(type(height))    
print(type(true))
print(type(hobbies))   




#14)while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60 ...

number = 50

while number <= 100:
    print(number)
    number += 5


#15)for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 ...


for number in range(40, 91, 3):
    print(number)



#16)გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით




for i in range(15):
    print("საბა საღლიანი")



name = 0
while name < 15:
    print("საბა საღლიანი")
    name += 1










#17)
#შექმენი ცვლადი სადაც შეინახავ შენს სახელს
#შექმენი ცვლადი სადაც შეინახავ შენს გვარს
#მომხმარებელს შემოატანინეთ სახელი
#თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#     მომხმარებელს შემოატანინე გვარი
#      თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#            დაპრინტე --> same name and surname
#      სხვა შემთხვევაში
#            დაპრინტე -- > same name but different surname
#სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#    დაპრინტე --> aqedan moshordi


#HARDER(შეეცადეთ რომ ამოხსნათ თუ ვერ გამოვა შემდედგზე განვიხილავთ,მაინტერესებს დაძლევთ თუარა წესით უნდა გააკეთოთ!!!!!

    
my_name = "საბა"
my_surname = "საღლიანი"


user_name = input("შეიყვანე სახელი: ")

if user_name == my_name:
    
    user_surname = input("შეიყვანე გვარი: ")
    
    if user_surname == my_surname:
        print("same name and surname")
    else:
        print("same name but different surname")
else:
    print("aqedan moshordi")



#18)
#შექმენი ცვლადი სადაც შეინახავ პაროლს
#მომხმარებელს შემოატანინე პაროლი
#სანამ პირობა არის ჭეშმარიტი(True)
#      თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#            დაპრინტე --> გამოიცანი
#             break
#      სხვა შემთხვევაში:
#         თავიდან გაუმეორე რომ შემოიყვანოს პაროლი



    
correct_password = "1234"


while True:
    user_input = input("enter password: ")
    
    if user_input == correct_password:
        print("good guess!")
        break
    else:
        print("wrong, try again")








