#1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

name_1 = input("შეიყვანე შენი სახელი: ")
print(name_1.upper())



#2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით


name_2 = input("შეიყვანე შენი სახელი დიდი ასოებით: ")
print(name_2.lower())


#3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი


name_3 = input("შეიყვანე შენი სახელი პატარა ასოებით: ")
print(name_3.capitalize())



#4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით

names = ["giorgi", "nika", "mari", "ana"]
length_1=len(names)
for i in range(length_1):
    print(names[i].upper())




#5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით


names_2 = ["GIORGI", "NIKA", "MARI", "ANA"]
length_2=len(names_2)
for i in range(length_2):
    print(name_2[i].lower())


#6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს


names_3 = ["giorgi", "nika", "mari", "ana"]
length_3 = len(names_3)

for i in range(length_3):
    print(names_3[i].capitalize())



#7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს


elements = ["alma", "banani", "msxali", "atami"]
length_4 = len(elements)
print("სიგრძეა:", length_4)



#8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს

name_4 = "ალექსანდრე"
length_5 = len(name_4)
print("სტრინგის სიგრძეა:", length_5)



#9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა


numbers = [1, 2, 3, 4, 5, 6, 8, 9, 10]
length_6 = len(numbers)
even_count = 0

for i in range(length_6):
    if numbers[i] % 2 == 0:
        even_count += 1

print("ლუწი რიცხვების რაოდენობაა:", even_count)



#10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა


numbers_2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
length_6 = len(numbers_2)
odd_count = 0

for i in range(length_6):
    if numbers_2[i] % 2 != 0:
        odd_count += 1

print("კენტი რიცხვების რაოდენობაა:", odd_count)



#11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

start = int(input("შეიყვანე რიცხვი : "))
end = int(input("შეიყვანე რიცხვი : "))
step = int(input("შეიყვანე რიცხვი : "))


for i in range(start, end, step):
    if i % 2 == 0:
        print(i)
