#1)შექმენით 10 ელემენტიანი სია, და ამ სიიდან ბოლო 5 ელემენტი გამოიტანეთ დადებითი სლაისინგით



list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

bolo_xuti = list_1[5:10]
print(bolo_xuti)



#2)შექმენით 20 ელემენტიანი სია, და ამ სიიდან პირველი 11 ელემენტი გამოიტანეთ ყაროფიტითი ინდექსებით


list_2 = (1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 22, 2, 1)

# პირველი 11 ელემენტი უარყოფითი ინდექსებით:
pirveli_tertmeti = (list_2[-20:-9])

print(pirveli_tertmeti)

#3)შექმენით 12 ელემენტიანი სია, და მომხარებელს შემოატანინე რიცხვი, შემდეგ 2 იდან მომხარებლის შემოტანილ რიცხვამდე გამოიტანე ყველა ელემენტი


list_3 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]  

user_input = int(input("შეიყვანე რიცხვი (მაქსიმუმ 12): "))
list_4 = list_3[2: user_input ]
print(list_4)


