# 1) შექმენით სია რომელშიც იქნება მხოლოდ int მონაცემთა ტიპის ელემენტები, ამ სიიდან ამოშალე ყოველი რიცხვი რომელიც არის ლუწი ან დგას კენტ ინდექსზე სიაში, გამოიყენეთ remove() ფუნქცია და for ციკლი.


nums = [1, 2, 3, 4, 5, 6, 7, 8]

for i in nums:
    if i % 2 == 0 and nums.index(i) != nums.index(i):
        nums.remove(i)



# 2) შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა ის სიტყვა რაც უკვე არის ამ სიაში, გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია. 

# 2) string სია – ბოლოში მეორედ დამატება
words = ["Hello", "world", "Python", "code", "Test", "example"]

for i in words:
    words.append(i)

print(words)




# 3) შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და შესაფერისი სიის ფუნქცია.


strings = ["Hello", "world", "Python", "code", "Test", "example"]
numbers = [10, 25, 30, 45, 60, 5]

for i in numbers:
    if 20 < i < 50:
        strings.append(str(i))

print(strings)




# 4) შექმენით სიტყვებით სავსე სია და ამ სიაში ყველა ისეთ სიტყვას რომელიც იწყება პატარა ასოთი, პირველი ასო გაუხადეთ დიდი. გამოიყენეთ for ციკლი და სტრინგის შესაბამისი ფუნქცია.

words = ["Hello", "world", "Python", "code", "Test", "example"]

for i in range(len(words)):
    if words[i][0] == words[i][0].lower():
        words[i] = words[i].capitalize()

print(words)



# 5) თქვენი სიტყვებით ახსენით რას აკეთებს გავლილი მასალიდან ყველა შესწავლილი სიის და სტრინგის ფუნქციები და for ციკლი.