#1)კომენტარის სახით ახსენით თუ რა არის index და რაში ვიყენებთ მას

# index (ინდექსი) არის რიცხვი, რომელიც მიუთითებს ელემენტის მდებარეობას სიაში.
# მას ვიყენებთ კონკრეტული ელემენტის ასარჩევად.




#2)შექმენით ცვლადი სადაც შეინახავთ ამ სიას [4,6,1,5,9,8,4] ,თქვენი დავალებაა რომ მიწვდეთ ამ სიაში ელემენტებს ინდექსინგის გამოყენებით ,შეკრიბეთ ორი რიცხვი რომ მიიღთ შემდეგი რიცხვები --> 10 , 2 , 14 , 20 , 4 , 7 , 27 , გამოიყენეთ მათემატიკური ოპერატოები

list_1=[4,6,1,5,9,8,4]

print(list_1[1] + list_1[0])
print(list_1[1] - list_1[0])
print(list_1[1] + list_1[5])
print(list_1[4] + list_1[2] + list_1[2] + list_1[2] + list_1[5])
print(list_1[0])
print(list_1[3] + list_1[2] + list_1[2])
print(list_1[4] + list_1[2] + list_1[2] + list_1[2] + list_1[5] + list_1[3] + list_1[2] + list_1[2])




#3)შექმენით სია სადაც შეიყვანთ ადამიანის სახელებს,უნდა გქონდეთ სულ 10 სახელი,თქვენი დავალებაა რომ გამოიტანოტ ,მე 5 , მე 9 ,მე 3 ,მე 7 და პირველ ინდექსზე მდგომი ელემენტები ცალ ცალკე,გამოიყენეთ ინდექსინგი
# ვქმნით სიას 10 ადამიანის სახელით
names = ["ნინო", "საბა", "მარიამი", "გიორგი", "ანა", "თომა", "ეკატერინე", "დავითი", "სოფო", "ირაკლი"]

# ინდექსინგის გამოყენებით ვბეჭდავთ:
print("მე 5:", names[5])   
print("მე 9:", names[9])  
print("მე 3:", names[3])   
print("მე 7:", names[7])   


#4)შექმენით სია სადაც მოათავსებთ სტრინგ ტიპის მონაცემებს,თქვენი დავალებაა გომ for loop და while loop (ორივე) ს დახმარებით გამოიტანოთ თთოეული ელემენტი ცალ ცალკე
names = ["ნინო", "საბა", "მარიამი", "გიორგი", "ანა", "თომა", "ეკატერინე", "დავითი", "სოფო", "ირაკლი"]
print("for loop-ის შედეგი:")
i=0
while i < 10:
    print(names[i])
    
    i=i+1

for i in range(10):
    print(names[i])




#5)შექმენით სია სადაც შეინახავთ 7 ცალ ელემენტს(მონაცემის ტიპს არ აქვს მნიშვნელობა),თქვენი დავალებაა რომ ამ სიაში შეცვალოთ მე 3 ინდექსზე დმგომი ელემენტი და ჩაანაცვლო "vashli" ით, ასევე შეცვალე მე 6 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე 'msxali' ით ,ასევე შეცვალე მე 4 ინდექსზე მდგომი ელემენტი და ჩაანაცვლე ის 'atami" ით,გამოიტანე საბოლოო სია ტერმინალში,სადაც ეს სალი ელემენტი იქნება განახლებული~

vegetables = ["კარტოფილი", "სტაფილო", "ბადრიჯანი", "კომბოსტო", "კიტრი", "პამიდორი" , "ხახვი"]


vegetables[6] = "msxali"        
vegetables[3] = "vashli"      
vegetables[4] = "atami"     


i=0
while i < 7:
    print(vegetables[i])
    
    i=i+1




#6)იპოვეთ საბოლოო პასუხი--> True and False or False and True or false and false or true ---> ...

#true



#7)შექმენით სია სადაც მოთავსებული გექნებათ ცხოველების სახელები, თქვენი დავალებაა რომ -->  თუ ამ სიაში მოთავსებული მე 3 ინდექსზე მდგომი ელემენტი არის ლომი მაშნ დაპრინტე --> "there is lion on index 3" სხვა შემთხვევაში დაუპრინტე რომ --> "there is no lion on index 3"
animals = ["tiger", "hedgehog", "fish", "lion", "turtle"]

if animals[3] == "lion":
 print("there is lion on index 3")
else:
 print("there is no lion on index 3")




#8)
#basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

#დაბეჭდეთ კალათის პირველი ხილი.

#დაბეჭდეთ კალათის მესამე ხილი.

#შეცვალეთ მეორე ხილი "ბანანი" სხვა ხილით (თქვენი არჩევანით).

#დაბეჭდეთ თავიდან ბოლომდე ყველა ხილი ცალ–ცალკე, ინდექსების გამოყენებით (არა for-ით).


basket = ["ვაშლი", "ბანანი", "საზამთრო", "ატამი", "ყურძენი"]

print(basket[0])
print(basket[2])
basket[1]="მარწყვი"
print(basket[0])
print(basket[1])
print(basket[2])
print(basket[3])
print(basket[4])





#9)
#letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

#დაბეჭდეთ მესამე ასო.

#დაბეჭდეთ მე–5 და მე–6 ასო.

#დაბეჭდეთ ბოლო ასო.

#ააწყეთ სიტყვა "მამა" ინდექსებით (ყველა ასო ინდექსით უნდა აიღონ და შეაერთონ).

#ააწყეთ სიტყვა "გოლა".

#ააწყვეთ სიტყვა "გოგა"



letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]
print(letters[2])
print(letters[4], letters[5])
print(letters[9 ])
print(letters[6]+ letters[0] + letters[6] + letters[0])
print(letters[2]+ letters[3] + letters[4] + letters[5])
print(letters[2]+ letters[3] + letters[2] + letters[0])



    #10)
    #letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]

    #აიღეთ მე–4 ინდექსზე არსებული ასო და შეინახე ცვლადში

    #თუ ეს ასო არის "ლ", დაბეჭდეთ: "სწორია! ასო ლ ა"

    #სხვა შემთხვევაში დაბეჭდეთ: "არასწორია, სცადე თავიდან"

    #=========================
    #აიღეთ ბოლო ასო და შეინახე ცვლადში

    #თუ ეს "ე"–ა, დაბეჭდეთ "საიდუმლო სიტყვა იწყება სწორად".

    #სხვა შემთხვევაში – "საიდუმლო სიტყვა არასწორია".
    #==========================

    #ააწყვეთ სიტყვა "გელა" და შეინახე ცვლადში 

    #თუ ცვლადში შენახული სიტყვა "გელა"–ს ტოლია, დაბეჭდეთ "გაარტყი სახელი!"

    #სხვა შემთხვევაში – "შტერი ხარ!დ".


letters = ["ა", "ბ", "გ", "ო", "ლ", "ა", "მ", "ა", "ტ", "ე"]


letter_variable = letters[4]

if letter_variable == "ლ":
    print("სწორია! ასო ლ ა")
else:
    print("არასწორია, სცადე თავიდან")


last_letter = letters[9]

if last_letter == "ე":
    print("საიდუმლო სიტყვა იწყება სწორად")
else:
    print("საიდუმლო სიტყვა არასწორია")


 


word = letters[2] + "ე" + letters[4] + letters[5]  

if word == "გელა":
    print("გაარტყი სახელი!")
else:
    print("შტერი ხარ!დ")    

#11)შექმენი სია რომელიც იქნება სტრინგებით სავსე,შენი დავალებაა რომ მომხმარებელს შემოატანინო რაიმე რიცხვი,შენი დავალებაა რომ ამ სიიდან გამოიტანო მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი



fruits = ["ვაშლი", "მსხალი", "ბანანი", "ატამი", "ალუბალი", "კივი", "ფორთოხალი"]

max_index = 6  


index = int(input("შეიყვანე რიცხვი (0-6): "))


if 0 <= index <= max_index:
    print("ამ ინდექსზე არის:", fruits[index])
else:
    print("არასწორი ინდექსია! სცადე თავიდან.")