#1) შემოატანინეთ მომხმარებელს 3 რიცხვი, შეამოწმეთ:
#თუ 1 და 2 რიცხვი ტოლია -> დაწერეთ 1 და 2 ტოლია
#თუ 1 და 3 რიცხვი ტოლია -> დაწერეთ 1 და 3 ტოლია
#თუ 2და 3 რიცხვი ტოლია -> დაწერეთ 2და 3 ტოლია
#თუ სამივე ტოლია -> დაწერეთ სამივე ტოლია
#თუ არცერთი არ არის ტოლი -> დაწერეთ არცერთი არ არის ტოლია 


integer_1 = int(input("შეიყვანე პირველი რიცხვი: "))
integer_2 = int(input("შეიყვანე მეორე რიცხვი: "))
integer_3 = int(input("შეიყვანე მესამე რიცხვი: "))


if integer_1 == integer_2 == integer_3:
    print("სამივე ტოლია")
elif integer_1 == integer_2:
    print("1 და 2 ტოლია")
elif integer_1 == integer_3:
    print("1 და 3 ტოლია")
elif integer_2 == integer_3:
    print("2 და 3 ტოლია")
else:
    print("არცერთი არ არის ტოლია")




#2) შემოატანინეთ მომხმარებელს რიცხვი 1-დან 12ჩათვლით:
#თუ ეს რიცხვი არის 12, 1, 2 -> დაპრინტეთ ზამთარი
#თუ ეს რიცხვი არის 3, 4, 5 -> დაპრინტეთ გაზაფხული
#თუ ეს რიცხვი არის 6, 7, 8 -> დაპრინტეთ ზაფხული
#თუ ეს რიხცვი არის 9, 10, 11 -> დაპრინტეთ


    month = int(input("შეიყვანე თვე (1-12): "))

if month==12 or month==1 or month==2:
    print("ზამთარი")
elif month==3 or month==4 or month==5:
    print("გაზაფხული")
elif month==6 or month==7  or month==8:
    print("ზაფხული")
elif month==9  or month==10 or month==11:
    print("შემოდგომა")
else:
    print("არასწორი რიცხვი, უნდა დაწეროთ 1-დან 12-მდე")



#3) შემოატანინეთ მომხმარებელს თავისი სახელი:
#თუ სახელი უდრის admin:
   #მოთხოვეთ შემოიყვანოს ადმინის პაროლი:
      #თუ პაროლი უდრის adminpassword123:
       # დაპრინტეთ სალამი ადმინ
      #სხვა შემთხვევაში:
       # დაპრინტეთ წვდომა არ გაქვს
#სხვა შემთხვევაში:
  #wდაპრინტეთ სალამი მომხმარებელო



    name = input("შეიყვანე შენი სახელი: ")

if name == "admin":
    password = input("გთხოვთ შეიყვანოთ ადმინის პაროლი: ")
    if password == "adminpassword123":
        print("სალამი ადმინ")
    else:
        print("წვდომა არ გაქვს")
else:
    print("სალამი მომხმარებელო")