#1) კომენტარის სახით ჩამოწერეთ  რომელი ახალი მათემატიკური ოპერატორები ვისწავლეთ,თითოეულ მათგანს მიუწერეთ  რომელი რას აკეთებს და თითზე მოიყვანე სამ-სამი მაგალითი











# 1)     ხარისი(**)
#გამოიყენება რიცხვის ხარისხში აყვანისთვის.


print(2 ** 3)   
print(5 ** 2)   
print(10 ** 0)  

# 2)  გაყოფა (//)
# ყოფს რიცხვს, აიგნორებს  ნაშთს და გამოაქ მთელი რიცხვი

print(10 // 3) 
print(20 // 4)  
print(7 // 2)   

# 3) % (ნაშთის პოვნა)
# ამ ოპერატორის დახმარებით ვპოულობთ გაყოფის ნაშთს.


print(10 % 3)   
print(20 % 4)   
print(7 % 2)        
















#2)კომენტარის სახით ახსენიტ თუ რითი განსხვავდებიან ერთმანეთისგან სიები და ცვლადები,და ასევე დაწერე თუ რაში ვიყენებთ სიებს

#ცვლადი გამოიყენება მხოლოთ 1 ელემენტის შესანახად, სიაში კი შეიძლება 1 ზე მეტი ელემენტის შევინახოთ. 
# სიას ვიყენებთ მაშინ როცა გვინდა ერთ ცვლადში ბევრ ელემენტზე ვიმუშაოთ







#   3)შექმენი სია რომელსაც შეინახავთ ცვლადში,ამ სიაში უნდა გქონდეს ყველა მონაცემთა ტიპის ელემენტი რომელიც ვისწავლეთ,სიის შექმნის შემდეგ დაპრინტეთ ეს სია





# სიაში შედის სხვადასხვა ტიპის მონაცემები
list = [ 10, 3.14, "გამარჯობა", True,  [1, 2, 3], ]

# სიის დაბეჭდვა
print(list)


