#1) for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე.  
  # თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
  # თუ კენტია -> "კენტი"  
  # ფორმატით:  
    #1 კენტია  
    #2 ლუწია
  



for i in range(1, 51):
    if i % 2 == 0:
        print(i, "ლუწია")
    else:
        print(i, "კენტია")


#2) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
   #- თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"  
   # - თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"  
   # - თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე" 
   #- სხვაგვარად -> "არ იყოფა არცერთზე"

for i in range(0, 21):
    if i % 3 == 0 and i % 5 == 0:
        print(i, "იყოფა 3-ზე და 5-ზე")
    elif i % 3 == 0:
        print(i, "იყოფა 3-ზე")
    elif i % 5 == 0:
        print(i, "იყოფა 5-ზე")
    else:
        print(i, "არ იყოფა არცერთზე")


#3) მომხმარებელს შემოატანინე რიცხვი. 
  # for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.  
   #დაბეჭდე შედეგი ამ ფორმატით:  
  # ლუწი რიცხვების რაოდენობა: X  
  # კენტი რიცხვების რაოდენობა: Y

number=int(input("input random number"))
odd=0
even=0

for i in range(0,number):
    if i % 2 ==0:
        odd=odd+1

    else:
        even=even+1


print(odd)
print(even)
        



#4) მოცემულია სია -> [10, 25, 33, 47, 80, 99]  
  # for ციკლით დაუარე თითოეულ ელემენტს.  
  # თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე" 
  # თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".


number=[10, 25, 33, 47, 80, 99]

for i in number:
    if i > 50:
        print(" more then 50")

    else:
        print( "less then 50")





#5) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.  
   #ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".

total=0

for i in range(0,101):
    if i % 2 == 0:
        print(i)

        total= total + i

print(total)









#6) შექმენი სია და შეინახეთ შიგნით სტრინგები  
   #for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.


list_1 = ["saba" ,  " gia " , "aleqsandre"]

for i in range(0,3):
    if list_1[i][0]=="a":
        print(list_1[i])
    else: 
        print("nothing")



#7) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
  # თუ რიცხვი არის ნული -> "ნულია"  
  # თუ კენტია -> "კენტია"  
  #თუ ლუწია -> "ლუწია".


for i in range(0, 21):
    if i == 0:
        print(i, "ნულია")
        
    elif i % 2 == 0:
     print(i, "ლუწია")


    else:
        print(i, "კენტია")


#8) შექმენი სია -> [5, 15, 25, 35, 45, 55] 
   #for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე.

numbers=[5, 15, 25, 35, 45, 55] 

for i in numbers:
    if i % 5 == 0:
        print( i )

    



#9) მომხმარებელს შემოატანინე სიტყვა.  
   #for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

word=input("write a word")
for i in word:
    print(i)
    


#10) შექმენი ცვლადი -> total = 0  
    #for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.  
    #ბოლოს დაბეჭდე -> "ჯამი არის: X".


total = 0  


for i in range(0,11):
    total=total+i
print(total)





