#1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი.  
#-> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე 
#-> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.


text = input("შეიყვანეთ სიტყვა ან ტექსტი: ")


length = len(text)



print(length)


for i in range(length):
    print(text[i])




#2) შექმენით სია სადაც შეინახავთ სტრინგებს.
#დაუარეთ სიის თითოეულ ელემენტს:
#1. დაპრინტეთ რამდენი სიმბოლოსაგან შედგება სიტყვა
#2. თუ სიტყვის სიგრძე არის: 
#--> კენტი დაპრინტეთ 'კენტია'
#--> ლუწი დაპრინტეთ 'ლუწია'



list_1=["saba" , "gega" , "luka" , "irakli"]


length_1=(len(list_1))

for i in range(length_1):
    print(len(list_1[i]))
    if len(list_1[i]) % 2 == 0:
        print(list_1[i] + " even") 

    else:
        print("odd")

