# ჩვენ ვისწავლეთ 4  სახის მონაცემთა ტიპი
#1) integer  2) float  3) string  4) boolean

#integer არის მთელი რიცხვი. მაგალითად: 1, 2, 10, 20, 100, და ა.შ.

#float არის რიცხვი ათწილადი მაგალითად: 1.5, 2.4, 10.1, 20.2, 100.3, და ა.შ.

#string არის ტექსტი რომელიც შეიძლება შეიცავდეს ასოებს, ციფრებს და სიმბოლოებს. ის უნდა იყოს პრჭყალებში ჩასმული მაგალითად: "Hello", "123", "187.3", და ა.შ.

# boolean არის მნიშვნელობა რომელიც შეიძლება იყოს true ან false. 

print ( "integer:", 10, 20, 30 )
print ( "float:", 10.5, 20.2, 30.3 )
print ( "string:", "Hello World", "123", "187.3" )
print ( "boolean:", True,  False )




# ცვლადი არის ადგილი სადაც შეგვიძლია ინფორმაციის შენახვა, ანუ შეგვიძლია ცვლადს მივანიჭოთ მნიშვნელობა. 

name = 'saba saghliani'
age = 16
hight= 1.87

print(name)
print(age)
print(hight)

