#1)შექმენით სია საცად მოათავსებტ 7 ადამიანის სახელს,თქვენი დავალებაა რომ ტერმინალში გამოიტანოთ ყველა ელემენტი ცალ ცალკე მინუს ინდექსებით

names = ["ანა", "გიორგი", "მარიამი", "ლაშა", "მარი", "ლუკა", "ნინო"]


print(names[-7])  
print(names[-6])  
print(names[-5])  
print(names[-4])
print(names[-3])  
print(names[-2])  
print(names[-1])  



#2)შექმენით 5 ცვლადი და შეინახეთეთ მათში სახელები,თქვენი დავალებაა რომ შეადგინოთ სია ამ ცვლადების გამოყენებით(გამოიყენეთ რათქმაუნდა ცვლადის სახელები),სიის შექმნის შემდეგ გამოიტანეთ ტერმინალში სიაში მყოფი ბოლო ელემენტი(გამოიყენეთ მინუს ინდექსები)


name1 = "ნიკა"
name2 = "ელენე"
name3 = "საბა"
name4 = "მანანა"
name5 = "დათო"


name_list = [name1, name2, name3, name4, name5]


print(name_list[-1])  




#3)შექმენით ცვლადი და შეინახეთ მნიშვნელობა "irakli" თქვენი დავალებაა რომ ინ=დექსინგის გამოყენებით ტერმინალში გამოიტანოთ ასო ბგერა K როგორც დადებით ასევე უარყოფითი ინდექსიტ

name = "irakli"


print(name[3])    


print(name[-3])   