#1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
#შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].

list_1 = [1, 2, 3, 4, 5, 6]
list_1[2:4] = [10, 20, 30]
print(list_1)



#2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
#შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].

list_2 = ["apple", "banana", "cherry", "kiwi", "mango"]
list_2[0:2] = ["pear", "plum"]
print(list_2)



#3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
#შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].

list_3 = ["a", "b", "c", "d", "e", "f"]
list_3[-3:] = ["x", "y", "z"]
print(list_3)



#4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
#შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].

list_4 = ["red", "green", "blue", "yellow", "black", "white"]
list_4[2:6] = ["purple", "orange"]
print(list_4)



#5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
#შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]

list_5 = ["გიორგი", "ირმა", "საბა"]
list_5 = ["red", "green", "blue", "yellow", "black", "white"]
print(list_5)



#===========================================



#6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი , თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".

list_6 = int(input("შეიყვანე რიცხვი: "))
if list_6 % 2 == 0:
    print("Even")
else: 
    print("Odd")


#7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე --> "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"

list_7 = [5, 12, 7, 8, 3, 9]
if list_7[3] % 2 == 0:
    print("Even number")
else:
    print("Odd number")


#8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --> "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"

list_8 = [11, 35, 88, 89, 102]
last_number = list_8[-1]

if last_number % 2 == 0 and last_number > 50:
    print("ეს რიცხვი არის ლუწი და მეტი 50 ზე")
elif last_number % 2 != 0 and last_number < 50:
    print("ეს რიცხვი არის კენტი და ნაკლები 50 ზე")


#9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100

list_9 = [19, 28, 66, 79, 114, 126]

if list_9[5] % 2 == 0 or list_9[5] > 100:
    print("even or more than 100")
elif list_9[3] % 2 != 0 or list_9[3] < 100:
    print("odd or less than 100")

    
#==============================================================



#10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს , გამოიყენე ახლად ნასწავლი ოპერატორი != 

string_1 = "hello"
string_2 = "world"

if string_1 != string_2:
    print("სტრინგები არ არის ტოლი")
else:
    print("სტრინგები ტოლია")
