#1)მომხმარებელს შემოატანინეთ ორი რიცხვი,შეადარეთ ეს ორი რიცხვი ერთმანეთს(გამოიყენეთ შედარების ოპერატორები(>, <, ==)
num_1=int(input( "write a random number: " ))
num_2=int(input("write another random number: " ))


print (num_1 > num_2 )
print(num_1 < num_2 )
print(num_1 == num_2)





#2)შექმენით 5 ცვლადი,3 ცვლადში შეინახეთ რიცხვები რომლებიც იქნებაინ სტრინგის ტიპის,დანარჩენ 2 ცვლადში შეინახეთ ჩვეულებრიბი ინტეჯერები
#შენი დავალებაა იპოვო ამ ხუთი რიცხვის ნამრავლი,შემდეგ ეს ნამრავლი გაყავი რიცხვების რაოდენობაზე და დაპრინტე საბოლოო შედეგი,გამოიყენე შეაბამისი ფუნქცია რომ გადააქციო სტრინგი რიცხვები ინტეჯერად

ცვლადი_1= "15"
ცვლადი_2= "12"
ცვლადი_3= "11"
ცვლადი_4=  4
ცვლადი_5=  5


print((int(ცვლადი_1) * int(ცვლადი_2) * int(ცვლადი_3) * ცვლადი_4 * ცვლადი_5) / 5 )



#3)მომხმარებელს შემოატანინეთ სამი სტრინგ ტიპის მნიშვნელობა ასევე შემოატანინეთ ერთი ინტეჯერი,
#თქენი დავალებაა მომხმარებლის მიერ შემოყვანილ სამ სტრინგზე მოახდინოთ კონკატინაცია და შეინახოთ ცალკე ცვლადში ეს სამი გადაბმული სტრინგი,
#კონკატინაციის შემდეგ კი გაამრავლეთეს ეს მთლიანი სტრინგი მომხმარებლის მიერ შემოყვანილ რიცხვზე

str_1 = input ("country: ")
str_2 = input ("city: ")
str_3 = input ("street: ")
int_1 = input ("your age: " )
concatination=(str_1 + str_2 + str_3)
print(concatination * int(int_1 ))



#4)კომენტარის სახით ახსენით თუ რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომელი ოპერატორის დროს რას უფრო ენიჭება უპირატესობა(True , False) და რატომ


#ლოგიკური ოპერატორებია and და or ოპერატორები.
#and ოპერატორის გამოყენებისას თუ რომელიმე მონაცემი False არის, ტერმინალი False გამოიტანს პასუხად.
#or ოპერატორის გამოყენებისას თუ True მონაცემი გვაქ ტერმინალი True გამოიტანს.




#5)გვერდით მიუწერეთ რას გამოიტანს შემეგი ოპერაციები

     #(and)                             (or)
#True and True -- True     |   True or True -- True           
#True and False -- False    |   True or False -- True
#False and True -- False   |   False or True -- True
#False and False -- False    |   False or False -- False





#კომენტარის სახით მკიუწერეთ ასევე გვერდით თუ რატომ იქნება თქვენს მიერ შერჩეული პასუხი სწორი

#and ოპერატორის გამოყენებისას თუ რომელიმე მონაცემი False არის, ტერმინალი False გამოიტანს პასუხად.
#or ოპერატორის გამოყენებისას თუ True მონაცემი გვაქ ტერმინალი True გამოიტანს.



#6)მოიყვანე მაგალითები and და or ოპერატორებზე,დაპრინტე და გაუშვით ტერმინალში და ნახეთ შედეგი

print(True and False)
print(True and True)


print(True or False)
print(False or False)



#გავლილი მასალა:
#7)შექმენი 4 ცვლადი სადაც შეინახავთ სხვადასხვა მონაცემთა ტიპებს და შენი დავალებაა რომ გაიგო ამ ცვლადებში შენახული მონაცემების ტიპები(გამოიყენეთ შესაბამისი ფუნქცია)


ცვლადი_1 = "საბა"
ცვლადი_2 = 16
ცვლადი_3 = 1.87
ცვლადი_4 = True

print(type(ცვლადი_1))
print(type(ცვლადი_2))
print(type(ცვლადი_3))
print(type(ცვლადი_4))






#8)მომხმარებელს შემოატანინე 3 მნიშნველობა,ერთის ტიპი იყოს float ერთის integer ერთის string და დაპრინტეთ ისინი(გამოიყენეთ შესაბამისი ფუნქციები რომ შემოყვანილ მნიშვნელობებს ქონდეთ შესაბამისი ტიპი(note:მომხმარებელს რომ შემოყავს მნიშვნელობა თავიდან ყოველთვის არის სტრინგი),თუ ფლოათს
 #შემოიყვანს მომხმარებელი გახადეთ ინფუთი ბულეან ტიპის თუ ინტეჯერს შემოიყვანს გახადეთ ინფუთი ინტეჯერ ტიპის

integer = int(input ( " current year : " ))
float   = bool(input ( " height : " ))
string  = input ( " your name: ")


print(type(integer))
print(type(float ))