 
#1) შექმენით 10 ელემენტიანი სია. სლაისინგის დახმარებით (დადებითი ინდექსებით):
#--> გამოიტანეთ პირველი 5 ელემენტი
#--> გამოიტანეთ ბოლო 3 ელემენტი
#--> გამოიტანეთ ელემენტები 3 ინდექსიდან 7 ინდექსის ჩათვლით




numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]


print(numbers[:5])        


print(numbers[7:])       


print(numbers[3:8])     








#2) შექმენით 15 ელემენტიანი სია. სლაისების დახმარებით (უარყოფითი ინდექსებით):
#--> გამოიტანეთ პირველი 6 ელემენტი
#--> გამოიტანეთ ბოლო 10 ელემენტი
#--> გამოიტანეთ ელემენტები 7 ინდექსიდან 14 ინდექსის ჩათვლით (გონებაში გადაიყვანეთ უარყოფით ინდექსებში)


nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]


print(nums[:-9])     


print(nums[-10:])         


print(nums[-8:])          




#3) მოცემულია სიტვა 'თვითმფრინავი'
#გამოიტანეთ 'ნავი'


word_1 = "თვითმფრინავი"
print(word_1[7:])           






#4) მოცემულია სიტყვა 'Programmer'. სლაისინგის დახმარებით:
#--> გამოიტანეთ 'Pro' დადებითი და უარყოფითი ინდექსებით


word_2 = "Programmer"


print(word_2 [:3])           


print(word_2 [:-7])      
     









#5) შექმენით სია სადაც შეინახავთ კვირის დღეების სახელებს. სლაისინგის დახმარებით:
#--> გამოიტანეთ სამუშაო დღეები (დადებითი და უარყოფითი ინდექსებით)
#--> გამოიტანეთ დასვენების დღეები (დადებითი და უარყოფითი ინდექსებით)



days = ["ორშაბათი", "სამშაბათი", "ოთხშაბათი", "ხუთშაბათი", "პარასკევი", "შაბათი", "კვირა"]


print(days[:5])           


print(days[5:])        


print(days[:-2])          


print(days[-2:])         







#6) მოცემულია წინადადება: 'Python slicing is very powerful'. სლაისინგის გამოყენებით ->
#გამოიტანეთ: 
#'Python'
#'slicing'
#'powerful'
#გამოიყენეთ როგორც დადებითი ასევე უარყოფითი ინდექსები



sentence = "Python slicing is very powerful"


print(sentence[:6])      


print(sentence[7:14])     


print(sentence[23:])    

print(sentence[:-24])    
print(sentence[-24:-17])  
print(sentence[-8:])     