# 1) შექმენით წინადადების სტრინგის ცვლადი, ამ ცვლადში დაითვალეთ ხმოვანი ასოების რაოდენობა. გამოიყენეთ for ციკლი.

sentence = "it is never lupus"
xmovani = "aeiouAEIOU"

count = 0

for i in sentence:
    if i in xmovani:
        count += 1

print(count)



# 2) შექმენით რიცხვებით სავსე სია და დაითვალეთ ამ სიაში მყოფი მხოლოდ ლუწი რიცხვების ჯამი, გამოიყენეთ for ციკლი.

numbers = [3, 6, 9, 12, 15, 18]
total = 0

for num in numbers:
    if num % 2 == 0:
        total += num

print(total)



# 3) შექმენით რიცხვებით სავსე სია, გაიგეთ რომელი რიცხვი არის ამ სიაში ყველაზე დიდი, გამოიყენეთ for ციკლი, არ გამოიყენოთ max() ფუნქცია.

numbers = [45, 12, 78, 34, 90, 23]

largest = 0
for i in numbers:
    if i > largest:
        largest = i

print("Largest number:", largest)




# 4) მომხმარებელს შემოატანინეთ პაროლი, თუ პაროლის სიგრძე არის 6-ზე ნაკლები, მაშინ თავიდან შემოატანინეთ ახალი პაროლი, როცა პაროლის სიგრძე იქნება 6 ან 6-ზე მეტი, გააჩერეთ ციკლი და დაპრინტეთ "Your password is correct!" გამოიყენეთ while ციკლი.

while True:
    password = input("Enter password: ")
    if len(password) < 6:
        print("too short, try again.")
    else:
        print("Your password is correct!")
        break





# 5) შექმენით რიცხვებით სავსე  სია რომელშიც რამდენიმე რიცხვი მეორდება და დაპრინტეთ სია გამეორებების გარეშე, აუცილებლად იგივე თანმიმდევრობით. მაგალითად: თუ მოცემული გვაქვს სია [3, 5, 3, 8, 5, 10, 8], მაშინ ჩვენ უნდა დავპრინტოთ [3, 5, 8, 10]  გამოიყენეთ for ციკლი.


numbers = [3, 5, 3, 8, 5, 10, 8]

numbers_2 = []

for i in numbers:
    if i not in numbers_2:
        numbers_2.append(i)

print(numbers_2)


# 6) მომხმარებელს შემოატანინეთ წინადადება და ტერმინალში ყველა ახალ ხაზზე დაპრინტეთ ამ წინადადების სიტყვა და რიცხვი თუ რამდენჯერ მეორდება ეს სიტყვა წანადადებაში. მაგალითად: თუ მოცემული გვაქვს წინადადება "Hello I love apples Hello", მაშინ ტერმინალში ჯერ უნდა გამოვიდეს Hello 2, რადგან ეს სიტყვა 2-ჯერ მეორდება წინადადებაში, შემდეგ ხაზზე უნდა ეწეროს I 1, შემდეგ love 1, და ბოლოს apples 1. გამოიყენეთ სიები, არ გამოიყენოთ count() ფუნქცია ?



# 7) შექმენით რაიმე რიცხვის ცვლადი და მომხმარებელს შემოატანინეთ რიხვი, მომხმარებელმა უნდა შეეცადოს რომ გამოიცნოს ჩვენი რიცხვი, თუ მისი შემოტანილი რიცხვი არ უდრის ჩვენს რიცხვს, მაშინ ისევ თავიდან შემოატანინეთ მანამ სანამ არ გამოიცნობს. როცა ჩვენს რიცხვს გამოიცნობს, დაპრინტეთ თუ რამდენი ცდა მოუწია მანამ სანამ გამოიცნო, მაგალითად: "Correct! Attempts: 10" გამოიყენეთ while ციკლი


number = 7
attempts = 0

while True:
    guess = int(input("შეიყვანეთ რიცხვი: "))
    attempts += 1

    if guess == number:
        print("Correct! Attempts:", attempts)
        break
    else:
        print("Try again")
