#1)კომენტარის სახით ახსენი თუ რომელი ოპერატორები ვისწავლეთ და რა დანიშნულება აქვთ მათ

#ჩვენ ვისწავლეთ შედარების და მინიჭების ოპერატორები. შედარების ოპერატორებია:  <,  >,  ==. ისინი ადარებენ 2 მონაცემს, მინიჭების ოპერატორია; =  ის ანიჭებს ცვლადს მნიშვნელობას







#2)მომხმარებელს შემოაყვანინეთ ორი რიცხვი,შეადარეთ თუ პირველი რიცხვი მეტია მეორეზე,ასევე შეადარე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე,და ასევე შეადარე თუ პირველი რიცხვი უდრის მეორე რიცხვს

num_1=int(input( "write a random number: " ))
num_2=int(input("write another random number: " ))


print (num_1 > num_2 )
print(num_1 < num_2 )
print(num_1 == num_2)








#3)მომხმარებელს შემოატანინეთ 5 სტრინგ ტიპის მნიშვნელობა,შენი დავალებაა მოახდინო მათი კონკატინაცია
str_1 = input ("country: ")
str_2 = input ("city: ")
str_3 = input ("street: ")
str_4 = input ("building number: ")
str_5 = input ("apartment number: ")

print ("adress: " + str_1 + "," + str_2 + "," + str_3 + "," + str_4 + "," + str_5 )







#4)მომხმარებელს შემოატანინე 4 რიცხვი,შენი დავალებაა გაიგო ამ რიცხვების საშუალო არითმეტიკული(დღესაც ვისაუბრეთ ამაზე,ვნახოთ როგორ გაათმევთ თავს)


num_3 = int ( input ( "write a random number: " ))
num_4 = int ( input ( "write another random number: " ))
num_5 = int ( input ( "write a third random number: " ))
num_6 = int ( input ( "write a fourth random number: " ))



საშუალო_არითმეტიკული =(num_3 + num_4 + num_5 + num_6 )/4

print(საშუალო_არითმეტიკული)


#5)შექმენი 4 ცვლადი,ამ ცვლადებშ შეინახე 4 განსხვავებული მონაცემთა ტიპის ელემენტები და დაპრინტე მათ ტიპი(გამოიყენეთ შესაბამისი ფუნქცია)


ცვლადი_1 = "საბა"
ცვლადი_2 = 16
ცვლადი_3 = 1.87
ცვლადი_4 = True

print(type(ცვლადი_1))
print(type(ცვლადი_2))
print(type(ცვლადი_3))
print(type(ცვლადი_4))




#6)შექმენი 2 ცვლადი,შეინახე ორივე ცვლადში სტრინგ ტიპის მნიშვნელობები დაშეადარე ისინი არიან თუ არა ერთნაირები(უდრის თ არა ერთმანეთს)


ცვლადი_5 = "barbaqadze"
ცვლადი_6 = "wulukianii"
print(ცვლადი_5 == ცვლადი_6)






#7)შექმენი 4 ცვლადი,სადაც გექნება მოთავსებული რიცხვები ოღონდ სტრინგის სახით მაგ: "40",გადაიყვანე ეს სტრინგი რიცხვები ინტეჯერში(გამოიყენე შესაბამისი ფუნქცია) და გაიგე ამ ოთხი რიცხვის ჯამი

ცვლადი_7 = "30"
ცვლადი_8 = "55"
ცვლადი_9 = "12"
ცვლადი_10 = "76"

print(int(ცვლადი_7) + int(ცვლადი_8) + int(ცვლადი_9) + int(ცვლადი_10))







#8)შექმენი 3 ცვლადი,ამ ცვლადებში შეინახეთ ინტეჯერ ტიპის მონაცემები,შენი დავალებაა ეს რიცხვები გაასტრინგო(გამოიყენე შესაბამისი ფუნქცია) და გამოიტანო ეს რიცხვები ერთ წინადადებაში. მაგ:304050


ცვლადი_11 = 12
ცვლადი_12 = 32
ცვლადი_13 = 12


print(str(ცვლადი_11) + str(ცვლადი_12) + str(ცვლადი_13))





