# #1)კომენტარის სახით ჩამოწერე თითეული სიის ფუნქცია რაც ვისწავლეთ და მიუწერეთ გვერდით ახსნა განმარტება თუ რა გადაეცემა თითეულს და რას აკეთებს ის


# append()  სიაში ბოლოში ამატებს ახალ ელემენტს.
#  მას ფრჩხილებში გადაეცემა ელემენტი



# insert() → სიაში კონკრეტულ ინდექსზე ამატებს ახალ ელემენტს.
#  მას გადაეცემა insert(ინდექსი, ელემენტი)



# pop() → სიიდან შლის ელემენტს ინდექსით.
# მას გადაეცემა pop() ან pop(ინდექსი)
# თუ ინდექსი არ დაუწერე  შლის ბოლო ელემენტს;  
# თუ ინდექსი მიუწერე  შლის აღნიშნულ ინდექსზე მდომ ელემენტს.


# remove() → სიიდან შლის იმ ელემენტს რომლესაც მას არგუმენტად მისცემ .
# მას გადაეცემა   remove(ელემენტი)



# #2)შექმენი რიცხვების სია.
# #append() ფუნქციით დაამატე მასში რიცხვი 10 ბოლოში.
# #დაბეჭდე სია რომ ნახო ჩაემატა თუ არა

numbers = [1, 2, 3, 4, 5]
numbers.append(10)
print(numbers)


# #3)შექმენი სახელების სია.
# #append() ფუნქციით დაამატე შენი სახელი სიის ბოლოში
# #დაბეჭდე სია.

names = ["goga", "saba", "luka"]
names.append("საბა")   
print(names)


# #4)შექმენი სია სადაც შეიყვან სახელებს,შენიდავალებაა მომხმარებელს შემოატანინო რაიმე სახელი და შეინახო ცვლადში,შემდეგ ჩაამატე append()ის დახმარებით სიის ბოლოში მომხმარებლის შემოტანილი სიტყვა ~
# #დაბეჭდე სია რომნახო ჩაემატა თუ არა

names_2 = ["ana", "dato", "mari"]
user_name_2 = input("შეიყვანე სახელი: ")
names_2.append(user_name_2)
print(names_2)


# #5)შექმენი სია სადაც შეიყვანთ 5 სახეკს
# #.insert() დახმარებით სიაში ჩაამატე მესამე ინდექსზე შენი სახელი

names_3 = ["ana", "dato", "mari", "lizi", "nia"]
names_3.insert(3, "საბა")
print(names_3)



# #6)მომხმარებელს შემოატანინე სახელი და რიცხვი(integer 0 იდან 6 ჩათვლით)
# #შენი დავალებაა შექმნა სია მინიმუმ 6 ელემენტიანი
# #insert() დახმარებით დაამატე სიაში მომხმარებლის მიერ შემოტანილი რიცხვი,მომხმარებლის მიერ შემოტანილ ინდექსზე
# #მაგ:მომხმარებელმა სახელი შემოიტანა საბა და რიცხვი 4 , შენი დავალებაა რომ საბა დაამატო მეოთხე ინდექსზე(გამოიყენე ცვლადის სახელები იმიტომ რომ არ იცი მომხმარებელი რა მნშვნელობებს შემოიტანს
# #დაბეჭდე სია რომ ნახო ჩაემატა თუ არა

list = ["a", "b", "c", "d", "e", "f"]

user_name_3 = input("სახელი შეიყვანე: ")
user_index = int(input("რიცხვი 0-დან 6-მდე: "))

list.insert(user_index, user_name_3)
print(list)



# #7)შექმენი სია:

# #fruits = ["apple", "banana"]

# #insert() ფუნქციით ჩასვი "orange" 1 ინდექსზე.

fruits = ["apple", "banana"]
fruits.insert(1, "orange")
print(fruits)



# #8)შექმენი სია:

# #names = ["goga", "saba", "luka"]

# #insert()-ით ჩასვი "irakli" ბოლოს წინა პოზიციაზე ანუ ლუკას წინ

names_4 = ["goga", "saba", "luka"]
names_4.insert(2, "irakli")  
print(names_4)



# #9)შექმენი სია:

# #foods = ["bread", "milk", "cheese"]

# #insert() ფუნქციით ჩასვი "water" სიის დასაწყისში.

foods = ["bread", "milk", "cheese"]
foods.insert(0, "water")
print(foods)



# #10)შექმენი სია:numbers = [5, 10, 15]

# #pop() ფუნქციით წაშალე ბოლო ელემენტი და დაბეჭდე განახლებული სია.

numbers_2 = [5, 10, 15]
numbers_2.pop()
print(numbers_2)



# #11)შექმენი სია:

# #fruits = ["apple", "banana", "orange"]

# #pop -ით ამოშალე "banana" და დაბეჭდე დარჩენილი სია.

fruits_2 = ["apple", "banana", "orange"]
fruits_2.pop(1)   
print(fruits_2)


# 12)შექმენი სია:

# names = ["goga", "saba", "luka"]

# ამოშალე "saba" pop()-ით  — შემდეგ დაბეჭდე სია რომ ნახო ამოიშალა თუ არა


names_5 = ["goga", "saba", "luka"]
names_5.pop(1)   
print(names_5)


# 13)შექმენი სია:

# colors = ["red", "green", "blue" , "yellow" , "black" , "purple"]

# pop()-ით წაშალე "red" და დაბეჭდე განახლებული სია.

# შემდეგ სიიდან ასევე ამოშალე yellow

# დაბეჭდე სია და ნახე შედეგი


colors = ["red", "green", "blue", "yellow", "black", "purple"]

colors.pop(0)
print(colors)   
colors.pop(3)   

print(colors)


# 14)მომხმარებელს შემოტანინე რიცხვი(0 იდან 4 მდე და შეინახე ცვლადში

# შექმენი სია tems = ["pen", "pencil", "book", "eraser"] 

# pop ის დახმარებით სიიდან ამოშალე მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი

items = ["pen", "pencil", "book", "eraser"]

index = int(input("მიუთითე რიცხვი 0-დან 4-მდე: "))
items.pop(index)

print(items)


# 15)შექმენი სია:

# fruits = ["apple", "banana", "orange"]

# remove() ფუნქციით სიისდან წაშალე "banana".

# დაბეჭდე სია ნახე ამოიშალა თუ არა

fruits_2 = ["apple", "banana", "orange"]
fruits_2.remove("banana")
print(fruits_2)



# 16)შექმენი სია:

# nums = [3, 5, 3, 7]

# remove()-ით წაშალე 3 და დააკვირდი, მხოლოდ პირველი 3 იანი შაიშლება.

# დაბეჭდე სია რომ დარწმუნდე

number_5 = [3, 5, 3, 7]
number_5.remove(3)    
print(number_5)


# 17)შექმენი სია:

# colors = ["red", "blue", "green"]

# remove() ფუნქციით წაშალე "blue" და დაბეჭდე განახლებული სია.

colors_2 = ["red", "blue", "green"]
colors_2.remove("blue")
print(colors_2)


# 18)შექმენი სია:

# names = ["goga", "saba", "luka"]

# მომხმარებელს შემოატანინე ამ სამიდან რომელიმე სახელი შეინახე ცვლადში და remove()-ით წაშალე მომხმარებლის შემოტანილი სახელი სიიდან.

# დაბეჭდე სია რომ გაიგო მართლა ამოიშალა თუ არა

names_6 = ["goga", "saba", "luka"]

user_delete = input("რომელი სახელი წავშალო? (goga/saba/luka): ")

names_6.remove(user_delete)
print(names_6)


# 19)შექმენი სია:

# items = ["pen", "pencil", "book", "pencil"]

# remove()-ით წაშალე "pencil" და დაბეჭდე დარჩენილი სია.

list_2 = ["pen", "pencil", "book", "pencil"]
list_2.remove("pencil")   
print(list_2)

