#1) კომენტარების სახით ახსენით რა არის logical operators (andმ და or), რისთვის ვიყენებთ და მოიყვანეთ შესაბამისი მაგალითები.




#ლოგიკური ოპერატორებია and და or ოპერატორები.
#and ოპერატორის გამოყენებისას თუ რომელიმე მონაცემი False არის, ტერმინალი False გამოიტანს პასუხად.
#or ოპერატორის გამოყენებისას თუ True მონაცემი გვაქ ტერმინალი True გამოიტანს.



#2) მომხმარეებელს შემოაყვანინეთ სახელი, შეამოწმეთ იგი თუ უდრის თქვენს სახელს, არ დაგავიწყდეთ print ფუნქციის გამოყენება პასუხის დასაბეჭდად.


your_name=input("your name: ")
my_name="saba"
print(my_name == your_name)

#3) გააკეთეთ 2-2 მაგალითი or და and ოპერატორებზე.


print(True and False)
print(True and True)


print(True or False)
print(False or False)