#1)მომხმარებელს შემოატანინეთ ორი რიცხვი,შეამოწმეთ თუ პირველი რიცხვი მეტია მეორე რიცხვზე დაპრინტე რომ ‘first is more than second’,ასევე შეამოწმე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე დაპრინტე რომ ‘first is less than second’ და სხვა დანარჩენ შემთხვევაში დაპტინტე რომ ‘first number equal to second number’
num_1 = int(input("Enter first number: "))
num_2 = int(input("Enter second number: "))

if num_1 > num_2:
    print("first is more than second")
elif num_1 < num_2:
    print("first is less than second")
else:
    print("first number equal to second number")




#2)მომხმარებელს შემოატანინე რაიმე სტრინგი,ასევე შექმენი ცვლადი სადაც შეინახავთ თქვენს სახელს,შემდეგ შეამოწმე თუ მომხმარებლის შემოყვანილი სტრინგი უდრის შენა სახელს დაუპრინტე რომ ‘სეხნიები ვართ’ სხვა შემთხვევაში დაუპრინტეთ რომ ‘სხვადასხვა სახელები გავქვს’


user_name = input("შეიყვანე შენი სახელი: ")
my_name = "Kiki"   # აქ ჩაწერე შენი სახელი

if user_name == my_name:
    print("სეხნიები ვართ")
else:
    print("სხვადასხვა სახელები გვაქვს")



#3)შექმენი ორი ცვლადი სადაც შეინახავთ ინტეჯერ ტიპოს მონაცემებს,თქვენი დავალებაა შეამოწმოთ,თუ პირველი რიცხვი მეტია 0 ზე და და მეორე რიცხვიც მეტია 0 ზე დაუპრინტე რომ ‘ორივე რიცხვი დადებითია, ასევე შეამოწმე თუ პირველი რიცხვი ნაკლებია 0 ზე და მეორე რიცხვიც ნაკლებია 0 ზე დაპურინტე რომ  ‘ორივე რიცხვი არის უარყოფით’,სხვა დანარჩენ შემთხვევაში დაუპრინტე რომ ‘ეს რა ჯანდაბაა’

a = int(input("შეიყვანე პირველი რიცხვი: "))
b = int(input("შეიყვანე მეორე რიცხვი: "))

if a > 0 and b > 0:
    print("ორივე რიცხვი დადებითია")
elif a < 0 and b < 0:
    print("ორივე რიცხვი არის უარყოფით")
else:
    print("ეს რა ჯანდაბაა")


#4)დაატრიალეთ ფორ ლუპი 50 დან 100 მდე 2 ის გამოტივებით 

for i in range(50, 101, 2):
    print(i)


#5)ვაილ ლუპის გამოყენებით 20 დან 40 მდე გამოიტანეთ ყველა რიცხვი

i = 20
while i <= 40:
    print(i)
    i += 1




