 #1)შექმენი 2 ცვლადი snake_case ის გამოყენებით,მიანიჭეთ ამ ცვლადებს ინტეჯერ ტიპის მონაცემები(რიცხვები),
 #შენი დავალებაა რომ ამ ორ ცვლადზე მოახდინო მათემატიკური ოპერაციები(+ - * /) და ეს ოპერაციები შეინახო სხვა ცვლადებში რომლებიც იქნებიან შექმნილები ასევე snake_case ის გამოყენებით მაგ:

 #num_1 = 20
 #num_2 = 30
 #sum_of_numbers = num_1 + num_2 ასე გაააკეთეთ სხვა მათემატიკურ ოპერაციებზეც


num_1 = 30
num_2 = 15
sum_of_numbers = num_1 + num_2
difference_of_numbers = num_1 - num_2
product_of_numbers = num_1 * num_2
divide_of_numbers = num_1 / num_2






 #2)შექმენი ცვლადი სახელად name რომელსაც მიანიჭებთ მნიშვნელობას თქვენს სახელს,თქვენი დავალებაა რომ ეს ცვლადი განააახლოთ 5 ჯერ და დაპრინტოთ ამ ცვლადის საბოლოო მნიშვნელობა

name = "saba"

name = "heisenberg"
name = "gregory house"
name = "jesse"
name = "scofield"
name = "shane"

print(name)




 #3)შექმენი 5 ცვლადი რომელსაც ერქმევა ერთი სახელი მაგრამ იქნება case sensitive,რაც იმას ნიშნავს რომ ამ ცვლადებში მყოფი ასოები იქნება ზოგი დიდი ზოგი პატარა,
  #ანუ ეს 5 ივე ცვლადი იქნება სხვადასხვა ცვლადები,დაპრინტე 5 ივე მათგანი და გამოიტანე პასუხი ტერმინალში

fighter_jet = "Su-32 Fullback"
Fighter_jet = "F-15 Strike Eagle"
Fighter_Jet = "F-22 Raptor"
FIghter_Jet = "F-35 Lightning"
FIGhter_Jet = "Mig-29 Fulcrum"

print(fighter_jet)
print(Fighter_Jet)
print(Fighter_jet)
print(FIghter_Jet)
print(FIGhter_Jet)



 #4)გაასოწრეთ შემდეგი ცვლადები და მნიშვნელობები,კომენტარის სახით მიუწერეთ თუ რა არის შეცდომა და შეასწორეთ


 #2name = "giorgi"         სწორი ვერსია: name = "giorgi"            რადგან ცვლადის რიცხვით დაწყება არ შეიძლება
 #user{name = "bubunauri"  სწორი ვერსია: user_name = "bubunauri"    რადგან ფუნქციაში ორი სიტყვა ქვეტირეთი უნდა იყოს დაკავშირებული
 #user_name = goga         სწორი ვერსია: user_name = "goga"         რადგან აკლია goga  მნიშვნელობას პრჭყალები
 #user-surname = axalaia   სწორი ვერსია: user_surname = "axalaia"   რადგან ცვლადს აკლია დამაკავშირებელი ქვეტირე და მნიშვნელობას პრჭყალები

  

 #5)შექმენი 5 ცვლადი რომელიც იქნება snake_case ით დაწერილი,მიანიჭეთ სტრინგ ტიპის მონაცემები,
 #თქვენი დავალებაა რომ გამოიტანოთ ამ 5 ცვლადის მნიშვნელობა ერთ გრძელ წინადადებად,კომენტარის სახით მიუწერეთ რა ქვია ამ მოქმედებას როდესაც სტრინგებს ვაერთებთ

word_1 = "Hector "
word_2 = "this "
word_3 = "is "
word_4 = "not "
word_5 = "personal"
print(word_1 + word_2 + word_3 + word_4 + word_5)      #ამ მოქმედებას კონკატინაცია ქვია



 #6)შექმენი 2 ცვლადი,ერთში შეინახე შენი სახელი მეორეშ კი რიცხვი 10,შენი დავალებაა შენი სახელი გამოიტანო ტერმინალში 10 ჯერ,მოახდინე შესაბამისი ამთემატიკური ოპერაცია

my_name = "saba "
multiplying_number = 10

print(my_name * multiplying_number)




 #7)კომენტარის სახით ახსენით თუ რომელი მათემატიკური მოქმედებების შესრულება არ შეგვიძლია სტრინგზე და ინტეჯერზე და რას მოგვცემს შედეგად

 # სტრინგზე არ შეგვიძლია გამოკლება, მიმატება, და გაყოფა. თუ ამას შევეცდებით ტერმინალში error გამოგვიტანს

 #მაგ:
 
print("saba" + 10)
print("saba" - 10)
print("saba" / 10)