#1)ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი,5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True

print(30 < 20  and 40 == 40) #false
print(15 == 15 and 20 < 10 ) #false
print(12 < 16  and 18 > 10 ) #true
print(67 < 60  and 40 > 70 ) #false
print(80 == 70 and 50 == 90) #false

print(20 < 40  or  40 > 30) #true
print(15 < 10  or  30 > 10) #true
print(10 < 4   or  90 < 80) #false
print(76 > 3   or  90 > 99) #true
print(7 == 7   or 88 == 88) #true

#2)კომენტარის სახით დაწერეთ თუ რა არის sequancing,iteration,selection აღწერე თითეული მათგანი თქვენი სიტყვებით
#sequancing – მოქმედება  სრულდება  თანმიმდევრობით.

#iteration(ციკლები) – ინსტრუქციების მეროდება სანამ მოცემული პირობა არ დაკმაყოფილდება.

#selection(გადაწყვეტილებები) – არჩევანი კეთდება სხვადასხვა გზას შორის.



#3)მოიყვანე secuencing ის მაგალითი,და კომენტარით მიუწერე რატომ არის შენს მიერ მოყვანილი მაგალითი sequence
print("Hello")  
print("World")
#მოქმედება ხდება თანმიმდევრობით

#4)კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის
#for loop არის ციკლი, რომელიც იმეორებს კოდის გარკვეული რაოდენობით ის გვეხმარება რომ ერთი და იგივე მოქმედება ბევრჯერ არ დავწეროთ.

#5)კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop
#range ფუნქციას გადაეცემა რიცხვი და იმ რაოდენობიტ გაიმეროებს ეს ფუნქცია მოცემულ კოდს.


#6)შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი ტერმინალში გამოიყენე for loop
for i in range(10):
    print("mustang gt500 1963")


#7)შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ
for i in range(100):
    print("saba saghliani")

#8)შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ
for i in range(46):
    print("green")

#)შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ
for i in range(32):
    print("s")

# გამეორება

#10)მომხმარებელს შემოატანინე 3 სტრინგ ტიპის და ერთი ინტეჯერ ტიპის მნიშვნელობები და შენი დავალებაა მოახდინო ამ ოთხი მნიშვნელობის კონკატინაცია(გამოიყენე შესაბამისი ფუნქცია რომ მოახდინოთ მონაცემთა ტიპიების გარდაქმნა ერთ მონაცემთა ტიპში რომ შეძლოთ კონკატინაცია)
str_1 = input ("country: ")
str_2 = input ("city: ")
str_3 = input ("street: ")
int_1 = input ("your age: " )
concatination=(str_1 + str_2 + str_3 + int_1)

#11)შექმენი 4 ცვლადი,თითოეულში შეინახე განსხვავებული მონაცემთა ტიპები,შენი დავალებაა გაიგო ამ ცვლადებში შენახული მნიშვნელობის მონაცემთა ტიპი(გამოიყენე შესაბამისი ფუნქცია)
ცვლადი_1 = "საბა"
ცვლადი_2 = 16
ცვლადი_3 = 1.87
ცვლადი_4 = True

print(type(ცვლადი_1))
print(type(ცვლადი_2))
print(type(ცვლადი_3))
print(type(ცვლადი_4))




#12)მომხმარებელს შემოატანინე 4 რიცხვი და ტერმინალში დააბრუნე ამ 4 რიცხვის ჯამ
int_2=int(input("current year: "))
int_3=int(input("your age: "))
int_4=int(input("birthyear: "))
int_5=int(input("random number: "))
print(int_2 + int_3 + int_4 + int_5)